# Rebar Shape Terminations Data Termination Orientation At Start Property

Source: https://www.revitapidocs.com/2026/321e6e08-2fb0-68e2-b89a-8151f152e859.htm

---

| Rebar Shape Terminations Data Termination Orientation At Start Property |
| --- |

Identifies the orientation of the termination (e.g. hook, crank) at start.

The default value is Left.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarTerminationOrientation TerminationOrientationAtStart { get; set; }
```

```
Public Property TerminationOrientationAtStart As RebarTerminationOrientation
	Get
	Set
```

```
public:
property RebarTerminationOrientation TerminationOrientationAtStart {
	RebarTerminationOrientation get ();
	void set (RebarTerminationOrientation value);
}
```

```
member TerminationOrientationAtStart : RebarTerminationOrientation with get, set
```

#### Property Value

RebarTerminationOrientation Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace